def filter_by_state(data_list: list, state='EXECUTED') -> list:
    """Функция принимает список словарей и опционально значение для ключа state
    возвращает новый список словарей, содержащий только те словари, у которых ключ соответствует указанному значению"""

    new_data_list = []
    return new_data_list

def sort_by_date(data_list: list, sort_value=None) -> list:
    """Функция принимает список словарей и необязательный параметр,
    задающий порядок сортировки (по умолчанию — убывание)
    возвращает новый список, отсортированный по дате (date)"""

    new_data_list = []
    return new_data_list